In [3]:
import pandas as pd

In [4]:
series = pd.Series(["BMW", "Toyota", "Honda"])

In [5]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [6]:
colors = pd.Series(["Red", "Blue", "White"])

In [7]:
colors

0      Red
1     Blue
2    White
dtype: object

In [8]:
car_data = pd.DataFrame({"car make": series, "Color": colors})
car_data

  car make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [9]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
car_sales.to_csv("exported-car-sales.csv", index= False)

In [11]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe Data

In [13]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [14]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [15]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [16]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [17]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [18]:
car_sales[car_sales["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [19]:
car_sales["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [20]:
car_sakes["Number of wheels"]= 4

NameError: name 'car_sakes' is not defined

In [21]:
car_sales["Number of wheels"]= 4

In [22]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Number of wheels
0  Toyota  White         150043      4   $4,000.00                 4
1   Honda    Red          87899      4   $5,000.00                 4
2  Toyota   Blue          32549      3   $7,000.00                 4
3     BMW  Black          11179      5  $22,000.00                 4
4  Nissan  White         213095      4   $3,500.00                 4
5  Toyota  Green          99213      4   $4,500.00                 4
6   Honda   Blue          45698      4   $7,500.00                 4
7   Honda   Blue          54738      4   $7,000.00                 4
8  Toyota  White          60000      4   $6,250.00                 4
9  Nissan  White          31600      4   $9,700.00                 4

In [23]:
car_sales["Passed road saftey"]= true

NameError: name 'true' is not defined

In [24]:
car_sales["Passed road saftey"]=True

In [25]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Number of wheels,Passed road saftey
0,Toyota,White,150043,4,"$4,000.00",4,True
1,Honda,Red,87899,4,"$5,000.00",4,True
2,Toyota,Blue,32549,3,"$7,000.00",4,True
3,BMW,Black,11179,5,"$22,000.00",4,True
4,Nissan,White,213095,4,"$3,500.00",4,True
5,Toyota,Green,99213,4,"$4,500.00",4,True
6,Honda,Blue,45698,4,"$7,500.00",4,True
7,Honda,Blue,54738,4,"$7,000.00",4,True
8,Toyota,White,60000,4,"$6,250.00",4,True
9,Nissan,White,31600,4,"$9,700.00",4,True